Revit 2027 API
BuiltInFailures.StairRampFailures.StairIncompleteFailure Property
 Stair element is incomplete, not all components are logic connected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairIncompleteFailure { get; }
Public Shared ReadOnly Property StairIncompleteFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairIncompleteFailure {
	FailureDefinitionId^ get ();
}
static member StairIncompleteFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace